app/Controllers/API/WalletAPI.php

            $mahasiswaModel = new \App\Models\MahasiswaModel();

            // Debug query
            $mahasiswa = $mahasiswaModel->where('token', $token)->first();
---
SELECT *
FROM `mahasiswa`
WHERE `token` = 'd80ce5967d384a489b441a9dbe867535906938e03f996c2b7cb2cf0f95ee40c4'
 LIMIT 1


            // Ambil data transaksi terbaru
            $transaksiModel = new \App\Models\DataTransaksiModel();
            $riwayat_transaksi = $transaksiModel->where('npm', $mahasiswa['npm'])
                ->orderBy('tanggal_transaksi', 'DESC')
                ->find();  // Menghapus limit untuk mendapatkan semua transaksi
---
SELECT *
FROM `data_transaksi`
WHERE `npm` = '1184097'
ORDER BY `tanggal_transaksi` DESC