app/Controllers/PoinMarket_Admin/Admin.php

    public function index()
    {
        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();

        $data = [
            'title' => 'Dashboard',
            'username' => $session->get('username'),
            // 'totaldata' => $this->KendaraanModel->total(),
            'totalReward' => $this->DataTransaksiModel->totalReward(),
            'totalPembelian' => $this->DataTransaksiModel->totalPembelian(),
            'totalPunishment' => $this->DataTransaksiModel->totalPunishment(),
            'totalMisi' => $this->DataTransaksiModel->totalMisi(),
            'totalKonsultasi' => $this->DataTransaksiModel->totalKonsultasi(),
            'transactions' => $this->DataTransaksiModel->getTransactionsByCategory(),
            // 'totalBadges' => $this->BadgesModel->totalBadges(),
            // 'totaluser' => $this->MahasiswaModel->total(),
            'jenis_transaksi' => $this->JenisTransaksiModel->getJenis(),
            'badges' => $this->BadgesModel->getBadges(),
            'mahasiswa' => $this->MahasiswaModel->getMhs(),
            'transaksi' => $this->TransaksiModel->getTransaksi(),
            'topMenuPages' => $topMenuPages,
        ];
---
SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'