app/Controllers/PoinMarket_Admin/Jenis_Transaksi.php

    public function reward()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('transaksi');
        $jenis = ['101'];
        $builder->whereIn('kode_jenis', $jenis);

        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $sideMenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();
---
SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'

    public function punishment()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('transaksi');
        $jenis = ['103'];
        $builder->whereIn('kode_jenis', $jenis);

        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $sideMenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();
---
SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'