app/Controllers/PoinMarket_Admin/Marketplace.php

SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'
SELECT *
FROM `transaksi`
---
    public function index()
    {
        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $sideMenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();

        $transaksi = $this->TransaksiModel->findAll(); // Pastikan model ini mengembalikan data yang sesuai