app/Controllers/PoinMarket_Admin/Quis.php

    public function index()
    {
        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $data = [
            'title' => 'Quis',
            'topMenuPages' => $topMenuPages,
            'quis' => $this->QuisModel->findAll(), // Ambil semua data kuis dari database
        ];
---
SELECT *
FROM `quis`
SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'