app/Controllers/PoinMarket_Admin/Transaksi.php

SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'
---
    public function index()
    // Benahi agar menampilkan data berdsarkan session/creator yg login
    {
        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $sideMenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();

        // Ambil data transaksi
        // $data_transaksi = $this->DataTransaksiModel->getDataTransaksi();

        // Menampilkan item yang dibuat berdasarkna session creator
        $data_transaksi = $this->DataTransaksiModel->getDataTransaksi();
        if (in_array($session->get('username'), ['superadmin', 'admin'])) {
            $datatransaksi_user = $data_transaksi;
        } else {
            $datatransaksi_user = array_filter($data_transaksi, function ($t) use ($session) {
                return $t['creator'] == $session->get('username');
            });
        }

        // Ambil data mahasiswa berdasarkan NPM untuk Detail
        $mahasiswa = [];
        foreach ($data_transaksi as $data) {
            $mahasiswaData = $this->MahasiswaModel->getNamaByNpm($data['npm']);
            $mahasiswa[$data['npm']] = $mahasiswaData ? $mahasiswaData['nama'] : '-'; // Jika nama mahasiswa tidak ditemukan
        }

        $data = [
            'title' => 'Pesanan',
            'username' => $session->get('username'),
            // 'data_transaksi' => $this->DataTransaksiModel->getDataTransaksi(),
            // 'data_transaksi' => $data_transaksi,
            'data_transaksi' => $datatransaksi_user,
            'transaksi' => $this->TransaksiModel->getTransaksi(),
            'npm' => $this->MahasiswaModel->getMhs(),
            'nama' => $mahasiswa,
            'jenis_transaksi' => $this->JenisTransaksiModel->getJenis(),
            // 'jenis' => $this->JenisTransaksiModel->getJenis(),
            'topMenuPages' => $topMenuPages,
            'sideMenuPages' => $sideMenuPages,
        ];

SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
---
    public function reward()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('data_transaksi');
        $jenis = ['101'];
        $builder->whereIn('kode_jenis', $jenis);

        $session = session();

        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();
        $sideMenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();

        // Menampilkan item yang dibuat berdasarkna session creator
        $transaksi = $this->DataTransaksiModel->getJenis($jenis);
        if (in_array($session->get('username'), ['superadmin', 'admin'])) {
            $datatransaksi_user = $transaksi;
        } else {
            $datatransaksi_user = array_filter($transaksi, function ($t) use ($session) {
                return $t['creator'] == $session->get('username');
            });
        }

        // Ambil data mahasiswa berdasarkan NPM
        $mahasiswa = [];
        foreach ($transaksi as $data) {
            $mahasiswaData = $this->MahasiswaModel->getNamaByNpm($data['npm']);
            $mahasiswa[$data['npm']] = $mahasiswaData ? $mahasiswaData['nama'] : '-'; // Jika nama mahasiswa tidak ditemukan
        }

        $data = [
            'username' => $session->get('username'),
            'title' => 'Rewards',
            // 'data_transaksi' => $this->DataTransaksiModel->getJenis($jenis),
            'data_transaksi' => $datatransaksi_user,
            'transaksi' => $this->TransaksiModel->getJenis($jenis),
            'jenis_transaksi' => $this->JenisTransaksiModel->getJenis(),
            'npm' => $this->MahasiswaModel->getMhs(),
            'nama' => $mahasiswa,
            'topMenuPages' => $topMenuPages,
            'sideMenuPages' => $sideMenuPages,
        ];