app/Controllers/CMS.php

SELECT *
FROM `pages`
WHERE `menu_position` = 'sidemenu'
SELECT *
FROM `pages`
WHERE `menu_position` = 'topmenu'
---
    public function index()
    {
        $sidemenuPages = $this->PageModel->where('menu_position', 'sidemenu')->findAll();
        $topMenuPages = $this->PageModel->where('menu_position', 'topmenu')->findAll();

INSERT INTO `pages` (`title`, `url`, `description`, `status`, `menu_position`) VALUES ('Dashboard', 'http://localhost:8080', 'Halaman Utama', 'active', 'none')
---
    public function store()
    {
        $this->PageModel->save([
            'title' => $this->request->getPost('title'),
            'url' => $this->request->getPost('url'),
            'description' => $this->request->getPost('description'),
            'status' => 'active',
            'menu_position' => $this->request->getPost('menu_position') // Menyimpan posisi menu
        ]);