app/Controllers/Marketplace.php

SELECT *
FROM `transaksi`
---
    public function toko()
    {
        $transaksi = $this->TransaksiModel->findAll(); // Pastikan model ini mengembalikan data yang sesuai

SELECT *
FROM `transaksi`
---
    public function market()
    {
        $session = session();
        // $isLoggedIn = $session->get('isLoggedIn'); // Ambil status login dari sesi
        $nama = $session->get('nama');
        $npm = $session->get('npm');
        // $mahasiswa = $this->MahasiswaModel->where('nama', $username)->first();

        // Mengambil total poin dari model Mahasiswa
        $mahasiswaData = $this->MahasiswaModel->getPointByNpm($npm);
        $totalPoints = $mahasiswaData['point'] ?? 0; // Menggunakan null coalescing operator untuk default 0
        // Memperbarui poin di session
        $session->set('point', $totalPoints);

        // Ambil semua transaksi yang tersedia
        $transaksi = $this->TransaksiModel->findAll(); // Pastikan model ini mengembalikan data yang sesuai

SELECT *
FROM `transaksi`
---
    public function misi()
    {
        $session = session();
        // $isLoggedIn = $session->get('isLoggedIn'); // Ambil status login dari sesi
        $nama = $session->get('nama');
        $npm = $session->get('npm');
        // $mahasiswa = $this->MahasiswaModel->where('nama', $username)->first();

        // Mengambil total poin dari model Mahasiswa
        $mahasiswaData = $this->MahasiswaModel->getPointByNpm($npm);
        $totalPoints = $mahasiswaData['point'] ?? 0; // Menggunakan null coalescing operator untuk default 0
        // Memperbarui poin di session
        $session->set('point', $totalPoints);

        // Ambil semua transaksi yang tersedia
        $transaksi = $this->TransaksiModel->findAll(); // Pastikan model ini mengembalikan data yang sesuai