app/Models/BadgesModel.php

SELECT COUNT(*) AS `numrows` FROM `badges`
---
    public function totalBadges()
    {
        return $this->countAll();