app/Models/DataTransaksiModel.php

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 101
---
    public function totalReward()
    {
        return $this->where('jenis_transaksi', 101)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 102
---
    public function totalPembelian()
    {
        return $this->where('jenis_transaksi', 102)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 103
---
    public function totalPunishment()
    {
        return $this->where('jenis_transaksi', 103)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 105
---
    public function totalMisi()
    {
        return $this->where('jenis_transaksi', 105)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 102
AND `npm` = '192837'
---
    public function Reward($npm)
    {
        return $this->where('jenis_transaksi', 101)->where('npm', $npm)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 103
AND `npm` = '192837'
---
    public function Pembelian($npm)
    {
        return $this->where('jenis_transaksi', 102)->where('npm', $npm)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 105
AND `npm` = '192837'
---
    public function Misi($npm)
    {
        return $this->where('jenis_transaksi', 105)->where('npm', $npm)->countAllResults();

SELECT *
FROM `data_transaksi`
WHERE `npm` IS NULL
AND   (
`jenis_transaksi` = '101'
OR `jenis_transaksi` = '105'
 )
AND `validation` = 'Sudah'
---
    public function getRewardsByNpmAndValidation($npm, $validationStatus = 'Sudah')
    {
        return $this->where('npm', $npm) // Ambil berdasarkan NPM
            ->groupStart() // Mulai grup kondisi
            ->where('jenis_transaksi', '101') // Pastikan ini adalah kode untuk reward
            ->orWhere('jenis_transaksi', '105') // Tambahkan kondisi untuk kode 105
            ->groupEnd() // Akhiri grup kondisi
            ->where('validation', $validationStatus) // Hanya ambil yang sudah divalidasi
            ->findAll();