app/Models/DataTransaksiModel.php

    public function getDataTransaksi()
    {
        return $this->findAll();
---
SELECT *
FROM `data_transaksi`

    public function getDataTransaksiUser($npm)
    {
        // Adjust your query to filter transactions based on the npm parameter
        return $this->where('npm', $npm)->get()->getResultArray();
---
SELECT *
FROM `data_transaksi`
WHERE `npm` = '123457'

    public function totalReward()
    {
        return $this->where('kode_jenis', 101)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 101

    public function totalPembelian()
    {
        return $this->where('kode_jenis', 102)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 102

    public function totalPunishment()
    {
        return $this->where('kode_jenis', 103)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 103

    public function totalMisi()
    {
        return $this->where('kode_jenis', 105)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 105

    public function totalKonsultasi()
    {
        return $this->where('kode_jenis', 106)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 106

    public function totalTransaksi()
    {
        return $this->where('validation', 'Sudah')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `validation` = 'Sudah'

    public function totalValidasi()
    {
        return $this->where('validation', 'Belum')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `validation` = 'Belum'

    public function Reward($npm)
    {
        return $this->where('kode_jenis', 101)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 103
AND `npm` = '123457'

    public function Pembelian($npm)
    {
        return $this->where('kode_jenis', 102)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 105
AND `npm` = '123457'

    public function Punishment($npm)
    {
        return $this->where('kode_jenis', 103)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `kode_jenis` = 106
AND `npm` = '123457'

    public function getJenis($jenis = false)
    {
        return $this->where(['kode_jenis' => $jenis])->find();
---
SELECT *
FROM `data_transaksi`
WHERE `kode_jenis` = ('103')

    public function getRewardsByNpmAndValidation($npm, $validationStatus = 'Sudah')
    {
        return $this->where('npm', $npm) // Ambil berdasarkan NPM
            ->groupStart() // Mulai grup kondisi
            ->where('kode_jenis', '101') // Pastikan ini adalah kode untuk reward
            ->orWhere('kode_jenis', '105')
            ->orWhere('kode_jenis', '102') // Tambahkan kondisi untuk kode 105
            ->groupEnd() // Akhiri grup kondisi
            ->where('validation', $validationStatus) // Hanya ambil yang sudah divalidasi
            ->findAll();
---
SELECT *
FROM `data_transaksi`
WHERE `npm` IS NULL
AND   (
`kode_jenis` = '101'
OR `kode_jenis` = '105'
OR `kode_jenis` = '102'
 )
AND `validation` = 'Sudah'