app/Models/MahasiswaModel.php

    public function total()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `mahasiswa`

    public function getMhs()
    {
        return $this->findAll();
---
SELECT *
FROM `mahasiswa`

    public function getPointByNpm($npm)
    {
        return $this->where('npm', $npm)->select('point')->first();
---
SELECT `point`
FROM `mahasiswa`
WHERE `npm` = '123457'
 LIMIT 1

    public function getNamaByNpm($npm)
    {
        return $this->where('npm', $npm)->first(); // Mengambil data mahasiswa berdasarkan NPM
---
SELECT *
FROM `mahasiswa`
WHERE `npm` = '123457'
 LIMIT 1