app/Models/PageModel.php

    public function get_all_pages()
    {
        return $this->where('status', 'active')->findAll();
---
SELECT *
FROM `pages`
WHERE `status` = 'active'