app/Models/PageModel.php

    public function get_all_pages()
    {
        return $this->findAll();
---
SELECT *
FROM `pages`